app/Controllers/AjaxController.php

    public function index()
    {
        $title = 'Daftar Artikel (AJAX)';
        $model = new \App\Models\ArtikelModel();

        $q       = $this->request->getVar('q') ?? '';
        $page    = (int) ($this->request->getVar('page') ?? 1);
        $perPage = 4;

        $builder = $model->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q)
                ->orLike('kategori.nama_kategori', $q);
        }

        $artikel = $builder->paginate($perPage, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 4