app/Controllers/Artikel.php

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '11'
SELECT *
FROM `kategori`
---
            return redirect()->to('admin');
        }

        $artikel = $artikelModel->find($id);
        $data = [
            'title' => "Edit Artikel",
            'data' => $artikel,
            'kategori' => $kategoriModel->findAll(),