app/Controllers/Home.php

SELECT *
FROM `artikel`
---
    public function index(): string
    {
        $title = 'Daftar Artikel';
        $model = new ArtikelModel();
        $artikel = $model->findAll();

SELECT *
FROM `artikel`
WHERE `kategori` = 'PHP'
---
    public function kategori($kategori)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('kategori', $kategori)->findAll();