app/Controllers/Page.php

    public function artikel($slug)
    {
        $model = new ArtikelModel();
        $artikel = $model->where('slug', $slug)->first();
---
SELECT *
FROM `artikel`
WHERE `slug` = '4-Lifechanging-ChatGPT-Features-You-May-Not-Know-About-Feb-2025'
 LIMIT 1