app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi' => $this->request->getVar('isi'),
        ];

        $model->insert($data);
        $insertedId = $model->insertID();
        $newData = $model->find($insertedId);
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Judul Artikel Pertama', 'Isi dari artikel pertama')
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = 22

    public function show($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->first();
---
SELECT *
FROM `artikel`
WHERE `id` = '2'
 LIMIT 1